const About = () => {
  return (
    <main className="flex justify-center mt-40">
      <div className="container pb-6 text-3xl font-light max-w-prose leading-normal">
        <p>إذا أخبرتك بوظيفتي أتكون عرفتني؟</p>
        <p>ماذا إذا عرفت مبلغي من العمر؟</p>
        <p>غني أنا أم فقير؟</p>
        <br />
        <p>
          كل ذلك توصيف لحال قد ألبث فيه أو يزول عني، لا يعلم ذلك إلا الله. لكن معرفتك لكل ذلك لن
          يعينك على أن تعرفني، لذلك لن أذكر منه شيء.
        </p>
        <br />
        <p>
          وإني لأظن أن لكل منا أصل، هو لنا كالعجين للخبز. إذا عرفت أصلي تكون قد عرفتني حق المعرفة.
        </p>
        <p>لذلك يحسن بي عند زيارتك لهذه الصفحة إن أخبرك بأن أصلي هو الفضول.</p>
      </div>
    </main>
  );
};

export default About;
